|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd
import numpy as np

### Read data and describe it

In [2]:
titanic = pd.read_csv("titanic_dataset.csv", index_col=0)

In [3]:
titanic.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
titanic.describe()

,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [5]:
titanic.describe(include="all")

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,"Kelly, Mr. James",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [6]:
titanic.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308],
           dtype='int64', length=1309)

In [7]:
titanic.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [8]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   gender     1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   object
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(2), int64(4), object(8)
memory usage: 153.4+ KB

### Find columns with missingdata

In [9]:
titanic.isna().any().any()

True

In [10]:
titanic.isna().any()

pclass       False
survived     False
name         False
gender       False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

In [11]:
titanic.loc[:,titanic.isna().any()]

,age,fare,cabin,embarked,boat,body,home.dest
0,29.0000,$211.34,B5,S,2,NaN,"St Louis, MO"
1,0.9167,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2.0000,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,30.0000,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,25.0000,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,14.5000,$14.45,NaN,C,NaN,328.0,NaN
1305,NaN,$14.45,NaN,C,NaN,NaN,NaN
1306,26.5000,$7.23,NaN,C,NaN,304.0,NaN
1307,27.0000,$7.23,NaN,C,NaN,NaN,NaN
1308,29.0000,$7.88,NaN,S,NaN,NaN,NaN

In [12]:
titanic.loc[:,titanic.isna().any()].columns

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

### Print shape of dataset

In [13]:
titanic.shape

(1309, 14)

In [14]:
titanic.size

18326

### drop columns with more than 25% missing data

In [15]:
titanic.isna()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,True,True,False
3,False,False,False,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,False,False,False,False,False,False,False,False,False,True,False,True,False,True
1305,False,False,False,False,True,False,False,False,False,True,False,True,True,True
1306,False,False,False,False,False,False,False,False,False,True,False,True,False,True
1307,False,False,False,False,False,False,False,False,False,True,False,True,True,True
1308,False,False,False,False,False,False,False,False,False,True,False,True,True,True

In [16]:
titanic.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [17]:
titanic.isna().sum()/(len(titanic))*100

pclass        0.000000
survived      0.000000
name          0.000000
gender        0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64

In [18]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [19]:
titanic.isnull().sum()/(len(titanic))*100

pclass        0.000000
survived      0.000000
name          0.000000
gender        0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64

In [20]:
titanic.isna().sum()/(len(titanic))*100 >= 25.0

pclass       False
survived     False
name         False
gender       False
age          False
sibsp        False
parch        False
ticket       False
fare         False
cabin         True
embarked     False
boat          True
body          True
home.dest     True
dtype: bool

In [21]:
titanic.loc[:, titanic.isna().sum()/(len(titanic))*100 >= 25.0]

        cabin boat   body                        home.dest
0          B5    2    NaN                     St Louis, MO
1     C22 C26   11    NaN  Montreal, PQ / Chesterville, ON
2     C22 C26  NaN    NaN  Montreal, PQ / Chesterville, ON
3     C22 C26  NaN  135.0  Montreal, PQ / Chesterville, ON
4     C22 C26  NaN    NaN  Montreal, PQ / Chesterville, ON
...       ...  ...    ...                              ...
1304      NaN  NaN  328.0                              NaN
1305      NaN  NaN    NaN                              NaN
1306      NaN  NaN  304.0                              NaN
1307      NaN  NaN    NaN                              NaN
1308      NaN  NaN    NaN                              NaN

[1309 rows x 4 columns]

In [22]:
titanic.drop(titanic.loc[:, titanic.isna().sum()/(len(titanic))*100 >= 25.0].columns, axis=1, inplace=True)

In [23]:
titanic.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

### drop columns having independent values(which do not affect the survival rate).

In [24]:
titanic.nunique(axis=0)

pclass         3
survived       2
name        1307
gender         2
age           98
sibsp          7
parch          8
ticket       929
fare         263
embarked       3
dtype: int64

In [25]:
titanic.nunique(axis=0, dropna=False)

pclass         3
survived       2
name        1307
gender         2
age           99
sibsp          7
parch          8
ticket       929
fare         264
embarked       4
dtype: int64

In [26]:
titanic.drop(['name','ticket'], axis=1, inplace=True)

In [27]:
titanic.head()

   pclass  survived  gender      age  sibsp  parch      fare embarked
0       1         1  female  29.0000      0      0  $211.34         S
1       1         1    male   0.9167      1      2  $151.55         S
2       1         0  female   2.0000      1      2  $151.55         S
3       1         0    male  30.0000      1      2  $151.55         S
4       1         0  female  25.0000      1      2  $151.55         S

### check data types of all columns

In [28]:
titanic.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

### convert price to numeric

In [29]:
titanic["fare"] = titanic["fare"].apply(lambda x : x[1:] if pd.notnull(x) else np.nan)

In [30]:
titanic["fare"] = titanic["fare"].astype("float64")

In [31]:
titanic.head()

   pclass  survived  gender      age  sibsp  parch    fare embarked
0       1         1  female  29.0000      0      0  211.34        S
1       1         1    male   0.9167      1      2  151.55        S
2       1         0  female   2.0000      1      2  151.55        S
3       1         0    male  30.0000      1      2  151.55        S
4       1         0  female  25.0000      1      2  151.55        S

In [ ]:
#titanic["fare"] = titanic["fare"].str.replace("$","").astype("float64")

In [32]:
titanic.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare        float64
embarked     object
dtype: object

### find columns still having missing/na values and also count of missing data

In [33]:
titanic.isna().sum()

pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
fare          1
embarked      2
dtype: int64

In [34]:
titanic.loc[:,titanic.isna().any()].columns

Index(['age', 'fare', 'embarked'], dtype='object')

### fill na with mean for fare and age column column.

In [35]:
titanic.fillna({"age":titanic.age.mean(), "fare":titanic.fare.mean()}, inplace=True)

In [36]:
titanic.isna().sum()

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
fare        0
embarked    2
dtype: int64

### drop na values for embarked column.

In [37]:
titanic.head()

   pclass  survived  gender      age  sibsp  parch    fare embarked
0       1         1  female  29.0000      0      0  211.34        S
1       1         1    male   0.9167      1      2  151.55        S
2       1         0  female   2.0000      1      2  151.55        S
3       1         0    male  30.0000      1      2  151.55        S
4       1         0  female  25.0000      1      2  151.55        S

In [38]:
print(titanic.shape)
titanic = titanic.dropna()
titanic.isna().sum()

(1309, 8)

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [39]:
titanic.shape

(1307, 8)

### dump the dataframe to a csv file 'titanic_filtered.csv'.

In [40]:
titanic.to_csv("titanic_filtered_by_me.csv")

### for surviced column replace 0 with D and 1 with A

In [41]:
titanic.head()

   pclass  survived  gender      age  sibsp  parch    fare embarked
0       1         1  female  29.0000      0      0  211.34        S
1       1         1    male   0.9167      1      2  151.55        S
2       1         0  female   2.0000      1      2  151.55        S
3       1         0    male  30.0000      1      2  151.55        S
4       1         0  female  25.0000      1      2  151.55        S

In [42]:
titanic.loc[:,"survived"] = titanic.loc[:,"survived"].map({1:'A',0:'D'})

In [44]:
titanic.head()

   pclass survived  gender      age  sibsp  parch    fare embarked
0       1        A  female  29.0000      0      0  211.34        S
1       1        A    male   0.9167      1      2  151.55        S
2       1        D  female   2.0000      1      2  151.55        S
3       1        D    male  30.0000      1      2  151.55        S
4       1        D  female  25.0000      1      2  151.55        S

### find the frequency of different values in survived column

In [45]:
titanic['survived'].value_counts()

D    809
A    498
Name: survived, dtype: int64

### group by gender and survived and see the counts in each category

In [51]:
titanic.groupby(by=['gender','survived']).size()

gender  survived
female  A           337
        D           127
male    A           161
        D           682
dtype: int64

### find different pclass and no of people in each class

In [52]:
titanic['pclass'].value_counts()

3    709
1    321
2    277
Name: pclass, dtype: int64

### find top 5 people with highest values of age. Count no of male and females in the top 5

In [54]:
titanic.sort_values(by="age", ascending=False)

      pclass survived  gender      age  sibsp  parch   fare embarked
14         1        A    male  80.0000      0      0  30.00        S
61         1        A  female  76.0000      1      0  78.85        S
1235       3        D    male  74.0000      0      0   7.78        S
135        1        D    male  71.0000      0      0  34.65        C
9          1        D    male  71.0000      0      0  49.50        C
...      ...      ...     ...      ...    ...    ...    ...      ...
1111       3        D    male   0.7500      1      1  13.78        S
427        2        A    male   0.6667      1      1  14.50        S
1240       3        A    male   0.4167      0      1   8.52        C
747        3        D    male   0.3333      0      2  14.40        S
763        3        A  female   0.1667      1      2  20.58        S

[1307 rows x 8 columns]

In [55]:
titanic.sort_values(by="age", ascending=False).head()

      pclass survived  gender   age  sibsp  parch   fare embarked
14         1        A    male  80.0      0      0  30.00        S
61         1        A  female  76.0      1      0  78.85        S
1235       3        D    male  74.0      0      0   7.78        S
135        1        D    male  71.0      0      0  34.65        C
9          1        D    male  71.0      0      0  49.50        C

In [56]:
titanic.sort_values(by="age", ascending=False).head().gender.value_counts()

male      4
female    1
Name: gender, dtype: int64

In [57]:
titanic.sort_values(by="age", ascending=False).head()["gender"].value_counts()

male      4
female    1
Name: gender, dtype: int64

### find max age male and female who survived

In [59]:
titanic[titanic["survived"] == "A"]

      pclass survived  gender      age  sibsp  parch    fare embarked
0          1        A  female  29.0000      0      0  211.34        S
1          1        A    male   0.9167      1      2  151.55        S
5          1        A    male  48.0000      0      0   26.55        S
6          1        A  female  63.0000      1      0   77.96        S
8          1        A  female  53.0000      2      0   51.48        S
...      ...      ...     ...      ...    ...    ...     ...      ...
1261       3        A  female  63.0000      0      0    9.59        S
1277       3        A    male  22.0000      0      0    7.23        C
1286       3        A  female  38.0000      0      0    7.23        C
1290       3        A  female  47.0000      1      0    7.00        S
1300       3        A  female  15.0000      1      0   14.45        C

[498 rows x 8 columns]

In [61]:
titanic[titanic["survived"] == "A"].groupby(by="gender").max()

        pclass survived   age  sibsp  parch    fare embarked
gender
female       3        A  76.0      4      5  512.33        S
male         3        A  80.0      4      2  512.33        S

In [62]:
titanic[titanic["survived"] == "A"].groupby(by="gender").max()["age"]

gender
female    76.0
male      80.0
Name: age, dtype: float64

### get average age by gender

In [67]:
titanic.groupby(by="gender").age.mean()

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [66]:
titanic.groupby(by="gender").age.median()

gender
female    29.881135
male      29.881135
Name: age, dtype: float64

### get average age by people survived vs not-survived

In [69]:
titanic.groupby(by="survived").age.mean()

survived
A    28.974711
D    30.389368
Name: age, dtype: float64